#include<bits/stdc++.h>
using namespace std;

int main(){
	string a,b,c,d,e;
	b = 'Y';
	c = 'N';
	cout<<"你好，mrh，我是来自过去的wlh。"<<'\n';
	cout<<"好久不见，见字如面，你还好吗？"<<'\n';
	cout<<"在过去的好多年里，我一直放不下的，是我们那璀璨的童年，那个我们终将不再的童年。"<<'\n';
	cout<<"你还记得我吗(Y or N)"<<'\n';
	cin>>a;
	if(a == b){
		cout<<"我也记得你，印象很深"<<'\n';
		cout<<"对你的印象，就像黑夜中的火炬，永不熄灭似的。"<<'\n';
		cout<<"你还记得我们曾经一起走过的小路吗？（Y or N）"<<'\n'; 
		cin>>d;
		if(d == b){
			cout<<"我很高兴你能记得"<<'\n';
			cout<<"虽然我自己都已经不太记得那段时光发生的事情。";
			cout<<"你还记得我们曾经有一次一起回教室拿伞吗，时至今日，我都快分不清究竟是曾经真实发生过的事情，又或者只是我个人的一场梦境"<<"\n";
			cout<<"你觉得是我个人的一场梦吗？(Y or N)";
			cin>>e;
			if(e == b){
				cout<<"果然不过是我自己的一场梦。"<<endl; 
			}
			else{
				cout<<"看来我的记忆没出问题。"<<endl;
			}
		}
		else{
			cout<<"果然，记忆是短暂的。"<<endl;
		}
	}
	else if(a == c){
		cout<<"这么多年过去了，忘记也在所难免"<<'\n';
		cout<<"时间总是飞速向前的"<<'\n';
		cout<<"希望我们还能再见"<<endl;
	}
}
